Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མདོ་སྡེ་སངས་རྒྱས་ཐམས་ཅད་སྐྱེ་ཞིང་འབྱུང་བ་ཞེས་བྱ་བ། མདོ་སྔེ་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: That tathāgata taught me the sūtra called The Birth and Arising of All Buddhas, together with accompanying sūtras as numerous as the atoms in ten buddha realms.

source: དེ་ཡང་ཁོ་མོས་ཐོས་ནས་ཡོངས་སུ་བཟུང་ངོ་། །
en: I heard it and retained it.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་མེའི་འོད་འཕྲོ་རིའི་དཔལ་གྱིས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་བྱུང་སྟེ་དེ་ལ་ཁོ་མོ་ཚོང་དཔོན་གྱི་བུ་མོར་གྱུར་པས་མཆོད་པ་བྱས་སོ། །
en: “After that, there was the tathāgata whose name was Jvalanārciḥ­parvata­śrī­vyūha. I was a head merchant’s daughter and made offerings to him.

source: དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མདོ་སྡེ་དུས་གསུམ་སྣང་བའི་སྙིང་པོ་ཞེས་བྱ་བ། མདོ་སྡེ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: That tathāgata taught me the sūtra called The Essence of the Light of the Three Times, together with accompanying sūtras as numerous as the atoms in Jambudvīpa.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱིས་མངོན་པར་འཕགས་པའི་ཤུགས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “After that, there was the tathāgata whose name was Sarva­dharma­samudrābhyudgata­vega­rāja.

source: དེ་ལ་ཁོ་མོ་ལྷའི་རྒྱལ་པོར་གྱུར་པས་མཆོད་པ་བྱས་སོ། །
en: I was a king of devas and made offerings to him.

source: དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མདོ་སྡེ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་ཐམས་ཅད་ཤེས་པའི་བྱེ་བྲག་ཅེས་བྱ་བ་མདོ་སྡེ་ལྔ་བརྒྱའི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: That tathāgata taught me the sūtra called The Categories of the Knowledge of All the Bases of the Realm of Phenomena, together with five hundred accompanying sūtras.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཟབ་མོའི་དཔལ་རྒྱ་མཚོས་ཡང་དག་པར་འབྱུང་བའི་འོད་ཅེས་བྱ་བ་བྱུང་སྟེ།
en: “After that, there was the tathāgata whose name was Gambhīra­dharma­śrī­samudra­prabha.

source: དེ་ལ་ཁོ་མོ་ཀླུའི་དབང་པོའི་བུ་མོར་གྱུར་པས། ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་སྟེ་མཆོད་པ་བྱས་སོ། །
en: I was the daughter of a lord of the nāgas and made an offering to him of the rain from a cloud of kings of precious wish-fulfilling jewels.

source: དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མད་སྡེ་དགའ་བ་རྒྱ་མཚོ་རྣམ་པར་འཕེལ་བའིཤུགས་ཤེས་བྱ་བ་མདོ་སྡེ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: That tathāgata taught me the sūtra called The Power of an Increasing Ocean of Delight, together with a million accompanying sūtras.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་རི་བོའི་སྤོའི་འོད་ཟེར་སྒྲོན་མ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “After that, there was the tathāgata whose name was Ratna­śikharārciḥ­parvata­pradīpa.

source: དེ་ལ་ཁོ་མོ་རྒྱ་མཚོའི་ལྷ་མོར་གྱུར་པས། རིན་པོ་ཆེའི་པདྨོའི་སྤྲིན་གྱི་ཆར་གྱིས་ཉེ་བར་བསྙེན་ཏེ་མཆོད་པ་བྱས་སོ། །
en: I was an ocean goddess who approached him and made an offering of the rain from a cloud of precious lotuses.

source: དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མདོ་སྡེ་ཆོས་ཀྱི་དབྱིངས་རྒྱ་མཚོའི་ཚུལ་ཞེས་བྱ་བ་མདོ་སྡེ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: That tathāgata taught me the sūtra called Ways of the Ocean of Phenomena, together with accompanying sūtras as numerous as the atoms in a buddha realm.

source: དེའང་ཁོ་མོས་ཐོས་ནས་ཡོངས་སུ་བླངས་སོ། །དྲན་པས་ཡང་དག་པར་བཟུང་ངོ་། །
en: I heard it and retained it, memorized it, and kept it.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྒྱ་མཚོ་སྣང་བའི་དཀྱིལ་འཁོར་གྱི་དཔལ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “After that, there was the tathāgata whose name was Guṇa­samudrāvabhāsa­maṇḍala­śrī.

source: དེ་ལ་ཁོ་མོ་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པར་གྱུར་པ། དྲང་སྲོང་སྟོང་ཕྲག་དྲུག་ཅུས་ཀུན་ནས་བསྐོར་བས་རྫུ་འཕྲུལ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པ་ཉེ་བར་བསྟན་ཏེ།
en: I was a ṛṣi with the five higher cognitions who was encircled by sixty thousand ṛṣis and manifested great miracles.

source: སྤོས་ཀྱི་མེ་ཏོག་རི་བོ་ཙམ་གྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་སྟེ། མཆོད་པ་བྱས་སོ། །
en: I approached him and made an offering of the rain from a mountain-sized cloud of perfumed lotuses.

source: དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མདོ་སྡེ་ཆོས་གནས་མེད་པའི་སྒྲོན་མ་ཞེས་བྱ་བ་མདོ་སྡེ་སྟོང་ཕྲག་བཅུའི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་སྟེ།
en: That tathāgata taught me the sūtra called The Lamp of Phenomena Being without Location, together with ten thousand accompanying sūtras.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་དཔལ་གྱི་སྙིང་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “After that, there was the tathāgata whose name was Vairocana­śrī­garbha.

source: ཁོ་མོ་ཡང་མཉམ་པ་ཉིད་ཀྱི་དོན་འབྱུང་བ་ཞེས་བྱ་བའི་སའི་ལྷ་མོ་ཞིག་ཏུ་གྱུར་ནས།
en: I was an earth goddess named Samatārtha­saṃbhavā.

source: ཁོ་མོ་སའི་ལྷ་མོའི་འཁོར་གྲངས་མེད་པ་དང་བཅས་པས་རིན་པོ་ཆེའི་ཤིང་ཐམས་ཅད་ཀྱི་ལྷུན་ལས་རིན་པོ་ཆེའི་མེ་ཏོག་གི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་སྟེ་རིན་པོ་ཆེའི་ཕྲེང་བའི་སྤྲིན་གྱི་ཆར་ཡང་རབ་ཏུ་ཕབ་ནས། དེ་བཞིན་གཤེགས་པ་དེ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་སྤྱན་སྔར་ཕྱིན་ཏོ། །
en: Together with a countless retinue of earth goddesses, I approached him to make an offering of the rain falling from a cloud of precious flowers and a cloud of strings of jewels that had arisen from the trunks of trees made of all jewels.

source: དེ་བཞིན་གཤེགས་པ་དེས་ཁོ་མོ་ལ་མདོ་སྡེ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཡང་དག་པར་འབྱུང་བའི་གནས་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བའི་མདོ་སྡེ་གྲངས་མེད་པའི་འཁོར་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: That tathāgata taught me the sūtra called The Essence of the Source of the WisdomThat Is the Origin of All the Tathāgatas, together with countless accompanying sūtras.

source: དེ་ཡང་ཁོ་མོས་ཐོས་ནས་བཟུང་སྟེ་ཆུད་ཟོས་པར་མ་བྱས་སོ། །
en: I heard it, retained it, and did not lose it.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ལྔ་བརྒྱ་པོ་དེ་དག་ཐམས་ཅད་ཀྱི་ཐ་མར་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའ་མཛོད་སྤུས་ཡོངས་སུ་རྒྱས་པའི་རྩེ་མོ་དཔལ་གྱི་སྒྲོན་མ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Noble one, the last of all those five hundred tathāgatas was the tathāgata Dharma­dhātu­gagana­pūrṇa­ratna­śikhara­śrī­pradīpa who appeared in the world.

source: དེའི་ཚེ་ཁོ་མོ་ཡང་གར་མཁན་གྱི་བུ་མོ་བཞིན་མངོན་པར་མཛེས་པའི་དཔལ་ཞེས་བྱ་བ་ཞིག་ཏུ་གྱུར་ཏེ།
en: At that time, I was the daughter of a dancer and had the name Abhirāma­śrīvakrā.

source: དེ་བཞིན་གཤེགས་པ་དེ་གྲོང་ཁྱེར་དུ་གཤེགས་ནས། གར་མཁན་གྱི་ཚོགས་ཀྱིས་རོལ་མོ་བྱས་པའི་ཚེ། ཁོ་མོས་སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་སྟེང་གི་ནམ་མཁའི་དབྱིངས་ལས། ཚིགས་སུ་བཅད་པ་སྟོང་གིས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མངོན་པར་བསྟོད་དེ་སྤྱན་སྔར་ཕྱིན་ཏོ། །
en: The tathāgata came to the city, and when the dancers were playing music, through the power of the Buddha I rose up into the air and praised the tathāgata with a thousand verses.

source: དེ་བཞིན་གཤེགས་པ་དེས་མཛོད་སྤུ་ནས་འོད་ཟེར་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་སྣང་བའི་རྒྱན་ཅེས་བྱ་བ་བཀྱེ་སྟེ།
en: Then I went to him. From the tathāgata’s ūrṇā hair shined a ray of light called the display of the radiance of the realm of the Dharma, which illuminated my entire body.

source: ཁོ་མོའི་ལུས་ཐམས་ཅད་ཀྱང་སྣང་བར་མཛད་དོ། །འོད་ཟེར་དེས་ཁོ་མོ་ལ་ཕོག་མ་ཐག་ཏུ་རྣམ་པར་ཐར་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ཡོངས་སུ་འཁྱིལ་བའི་སྙིང་པོ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: The instant that light touched my body, I obtained the liberation called the concentrated essence of the way of the realm of Dharma.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་སྩོགས་པ་བསྐལ་པ་འོད་ཆེན་པོ་ལ་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་འཁོར་ལོ་སྣ་ཚོགས་ཀྱིས་ཀླུབས་ཤིང་བརྒྱན་པར་སངས་རྒྱས་ལྔ་བརྒྱ་བྱུང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མཉེས་པར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་ཁོ་མོས་མཆོད་པ་ཡང་བྱས་སོ། །
en: “Noble one, in that way I pleased and made offerings to all those tathāgatas, the five hundred buddhas that appeared in the world realm called Maṇi­cakra­vicitra­pratimaṇḍita­vyūhā during the kalpa called Mahāprabha.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཁོ་མོ་ལ་ཆོས་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དྲན་ཏེ།
en: Those tathāgatas taught me the Dharma, and I remembered it all.

source: ཆོས་ཀྱི་ཚུལ་དེ་དག་ལས་ཡི་གེ་འགའ་འམ། ཚིག་འགའ་ཡང་བརྗེད་པར་མ་གྱུར་ཏོ། །
en: I did not forget a single letter or a single word of those ways of the Dharma.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་རེ་རེའི་དྲུང་དུ་འགྲོ་བའི་ཚེ་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བརྗོད་པར་བྱ་བས་སེམས་ཅན་ཚད་མེད་པའི་དོན་བྱས་སོ། །
en: “When I went before each of those tathāgatas, I recited the Buddha’s Dharma, and in that way I benefited countless beings.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་རེ་རེ་ལ་ཡང་ཁོ་མོས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་རྒྱ་མཚོ་དུས་གསུམ་གྱི་ཡེ་ཤེས་ཀྱི་སྙིང་པོ་ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་ཡངས་པ་ཞེས་བྱ་བའི་ཐམས་ཅད་མཁྱེན་པའི་གློག་མངོན་པར་སྣང་བ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ཐམས་ཅད་ལ་གནས་པར་ཡང་དག་པར་གཞོལ་བ་ཐོབ་པར་གྱུར་ཏེ།
en: “From each of those tathāgatas I obtained an ocean of the contents of the realm of the Dharma, an illumination from the lightning of omniscience, which was called The Extensive Realm of the Dharma That Is the Essence of the Knowledge of the Three Times, and I followed and continued all the completely good conduct.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ལ་ནི་དེ་ལྟར་ཡང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་དེ་བཞིན་གཤེགས་པ་མཐའ་དང་དབུས་མེད་པ་ཡོངས་སུ་སྣང་སྟེ།
en: “In that way, noble one, in each instant of mind there appear tathāgatas without outer limit or center.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཁོ་མོས་མཐོང་བར་གྱུར་པས་ཐམས་ཅད་མཁྱེན་པའི་ཀློག་མངོན་པར་སྣང་བ། །སྔོན་ཆད་མ་ཐོབ་པ་སྔན་ཆད་མ་མཐོང་བ དག་ཀྱང་ཁོ་མོའི་སེམས་ཀྱི་རྒྱུད་ལ་གནས་པར་གྱུར་ཏེ། འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ལས་གཡོ་བ་མེད་དོ། །
en: When I see those tathāgatas, there is the illumination of the lightning of omniscience, and that which I had not previously attained, which I had not previously seen, becomes present within the continuum of my mind, without ever deviating from the completely good conduct of the bodhisattva.

source: ཐམས་ཅད་མཁྱེན་པའི་ཀློག་མངོན་པར་སྣང་བ་ཐོབ་པ་འདི་ནི་མཐའ་དང་དབུས་མེད་པར་བསྟན་པའོ། །
en: This attainment of the illumination from the lightning of omniscience is a teaching that has no outer limit or center.”

source: དེ་ནས་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་ཀྱི་དཔལ་གྱིས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འཇིག་རྟེན་ཐམས་ཅད་མངོན་དུ་གྱུར་པས། འགྲོ་བ་རྣམ་པར་འདུལ་བ་ཞེས་བྱ་བ་འདི་བརྣན་ཏེ་བསྟན་པ་དང་། རྣམ་པར་དབྱེ་བར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། །ཟབ་མོ་བལྟ་དཀའ་ཁོང་དུ་ཆུད་དཀའ་སྟེ། །དུས་གསུམ་དབྱིངས་ཀུན་ཐ་དད་ཚུལ་ལྡན་ལ། །ཆོས་འོད་དཀྱིལ་འཁོར་ཀུན་ཏུ་འོད་འབྱུང་བའི། །
en: At that time, the night goddess Samanta­sattva­trāṇojaḥ­śrī, in order to teach further and classify the bodhisattva liberation called the manifestations that guide beings that appear in all worlds, through the blessing of the Buddha recited these verses to Sudhana, the head merchant’s son: “The profound view is difficult; it is difficult to comprehend The different ways of the extents of the three times And the completely shining domain of Dharma light.

source: ཁོ་མོའི་ཚིག་འདི་ནོར་བཟངས་མཉམ་པར་གྱིས། །
en: Listen to these words of mine, Sudhana.

source: སངས་རྒྱས་ཡོན་ཏན་འདོད་པས་བྱང་ཆུབ་ཏུ། །ཁོ་མོས་ཐོག་མ་ཇི་ལྟར་སེམས་བསྐྱེད་དང་། །ཇི་ལྟར་ཁོ་མོས་རྣམ་ཐར་འདི་ཐོབ་པ། །དེ་དག་རྣམ་པར་ཕྱེ་བའི་ཚུལ་འདི་ཉོན། །
en: {30} “Listen to me as I reveal the way, Wishing for the qualities of buddhahood, I first developed the aspiration for enlightenment And how it was I attained this liberation.

source: འདི་ནས་སངས་རྒྱས་ཞིང་གི་རྡུལ་སྙེད་ཀྱི། བསྐལ་པ་གཅིག་ནས་གཅིག་བརྒྱུད་ཕ་རོལ་ཏུ། །འཇིག་རྟེན་ཁམས་ཡངས་དྲི་མའི་སྐྱོན་མེད་པ། །རྣམ་སྣང་རྒྱལ་མཚན་སྒྲོན་མའི་དཔལ་བྱུང་སྟེ། །བསྐལ་པ་རྡུལ་དང་བྲལ་བའི་དཀྱིལ་འཁོར་བྱུང་། །
en: {31} “In the past, beyond kalpa after kalpa, As many as there are atoms in a buddha realm, There was a vast, stainless, faultless world realm Called Vairocana­dhvaja­pradīpa­śrī.

source: དེ་ལ་སངས་རྒྱས་རིགས་ནི་རྒྱུན་མ་ཆད། །
en: {32} “There had arisen the kalpa Virajomaṇḍala, In which there was a succession of buddhas.

source: དེ་ཚེ་རི་རབ་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། །སྟོབས་བཅུ་སྐྱོན་མེད་མང་པོ་བྱུང་བར་གྱུར། །
en: At that time those with the faultless ten strengths Appeared as numerous as the atoms in Sumeru.

source: དེ་ལ་བདེ་གཤེགས་ཐོག་མར་རིན་ཆེན་འོད། །ཀུན་ཏུ་འཕྲོ་དཔལ་ཡོན་ཏན་དཔལ་རྒྱལ་བྱུང་། རྒྱལ་བ་ཆོས་ཀྱི་རྒྱལ་མཚན་རི་རབ་དཔལ། །ཡོན་ཏན་སེང་གེའི་དབང་པོ་རྒྱལ་བ་ཞི། །
en: {33} “The first of those sugatas was Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja, Then there was the Jina Dharmadhvaja, then Śrīsumeru, And the fourth jina was Guṇa­keśarīśvara.

source: རྒྱལ་བ་ཞི་བའི་རྒྱལ་པོ་སྐྱེ་བཅིལ་དང་། །གྲགས་པའི་རི་བོ་ཡོན་ཏན་རི་རབ་དཔལ། །རྒྱལ་བ་ཉི་མ་ཟླ་ཞལ་བཅོམ་ལྡན་འདས། །བཅུ་པོ་དེ་དག་ཚུལ་འདི་ཐོག་མའོ། །རྒྱལ་བ་ནམ་མཁའི་གཞི་དང་ཀུན་ནས་འོད། །ཕྱོགས་སུ་ཡོངས་བྱུང་དྲན་པ་རྒྱ་མཚོའི་སྒོ། །
en: {34} “Then there were the Jina Śānti­rāja, Samitāyus, Yaśaḥparvata, Guṇa­sumeru­śrī, The Jina Abhāskara, and the Bhagavat Śaśimukha, And those were, in that way, the first ten.

source: རྒྱལ་བ་མངོན་འཕགས་འོད་མངའ་རི་རབ་དཔལ། །བདེ་གཤེགས་ཆོས་ཀྱི་འོད་འཕྲོ་རི་བོ་དཔལ། །ཐུགས་རྗེ་ཆེ་མངའ་དགུ་པ་པདྨོས་འཕགས། །
en: {35} “Then there were the Jina Gaganālaya, and Samataprabha, Diśasaṃbhava, Smṛti­samudra­mukha, The Jina Abhyudgata, Sumeruśrī, And the Sugata Dharmārci­parvata­śrī, {36} “Then Kāruṇika, and ninth was Padmodgata.

source: སངས་རྒྱས་བཅུ་པ་ཆོས་དབྱིངས་མེ་ཏོག་སྟེ། །
en: The tenth buddha was Dharma­dhātu­kusuma.

source: སངས་རྒྱས་རྒྱ་མཚོ་ཡོངས་སུ་བརྗོད་པ་ལས། །ཚུལ་འདི་བཅུ་པ་གཉིས་པ་འདི་ཡིན་ནོ། །འོད་དཔལ་རྒྱལ་པོ་ཡེ་ཤེས་བློ་གྲོས་དང་། །སྣ་ཚོགས་དོན་དབང་དཔལ་གྱི་བློ་གྲོས་ལྷ། །
en: In that way, these were the second ten From the description of the ocean of buddhas.

source: རྒྱལ་བ་ཤུགས་ཀྱི་རྒྱལ་བློ་ཡེ་ཤེས་དཔལ། །སྣང་བའི་རྒྱལ་པོ་འོད་ཀྱི་རྒྱལ་མཚན་དཔལ། །རྒྱལ་བ་རྣམ་པར་གནོན་པའི་ལྷ་སྟབས་དང་། །དེ་བཞིན་ཆོས་དབྱིངས་པདྨོ་བཅུ་པ་སྟེ། །
en: {37} “Then there were Prabha­ketu­rāja­mati, Jñānamati, Citrārthendra, Śrīdevamati, Jina Vegarājamati, Jñāna­śrī, And Avabhāsa­rāja, and Prabha­ketu­śrī, {38} “Then the Jina Vikrānta­deva­gati, And likewise Dharma­dhātu­padma.

source: རྒྱ་ཆེན་པ་ཡོངས་སུ་བསྟན་ལས་ཚུལ་འདི་ནི། །ཚུལ་འདིར་བཅུ་པ་གསུམ་པ་བསྟན་པའོ། །རིན་ཆེན་འོད་འཕྲོ་རི་དཔལ་བཅོམ་ལྡན་འདས། །
en: In that way, those were the third ten Within the way of this vast teaching.

source: དེ་ཡི་འོག་མ་ཡོན་ཏན་རྒྱ་མཚོ་དཔལ། །ཆོས་ཀྱི་འོད་དང་པདྨོ་སྙིང་པོ་དཔལ། །འགྲོ་བའི་ཟླ་བ་སྤྱན་ཚུལ་བདེ་བར་གཤེགས། །སྤོས་ཀྱི་འོད་དང་རིན་ཆེན་རི་རབ་དཔལ། །རྒྱལ་བ་དྲི་ཟ་ལུས་འོད་རྒྱལ་པོ་དང་། །རིན་ཆེན་སྙིང་པོ་རྒྱལ་དཔལ་གཟི་བརྗིད་ལྡན། །རྒྱལ་བ་བཅུ་པ་ཞི་བའི་གཟུགས་ཀྱི་སྟབས། །
en: {39} “Then there was the Bhagavat Ratnārci­parvata­śrī, And following him were Guṇa­samudra­śrī, Dharmaprabha, Padma­garbha­śrī, And the Sugata Gati­candra­netra­nayana, {40} “Then Gandhaprabha, Maṇisumeruśrī, Gandharva­kāya­prabha­rāja, and Maṇi­garbha­rāja­śri­teja­vatin, And the tenth jina was Praśama­rūpa­gati.

source: དེ་ཡི་འོག་མ་རྒྱལ་བ་རྒྱ་ཆེན་བློ། །རིན་ཆེན་འོད་དང་ནམ་མཁའི་སྤྲིན་གྱི་དཔལ། །རྒྱལ་བ་དམ་པའི་མཚན་གྱི་དཔལ་གྱུར་དང་། །བརྟུལ་ཞུགས་དཀྱིལ་འཁོར་རང་གི་ལུས་ཀྱི་འོད། །
en: {41} “Following them were the Jina Vipulabuddhi, Ratnaprabha, and Gagana­megha­śrī.

source: མཐུ་ཆེན་བརྟུལ་ཞུགས་རི་རབ་དཔལ་མངའ་དང་། །རྒྱལ་བ་ཡོན་ཏན་འཁོར་ཡུག་དཔལ་གྱི་རྒྱལ། །བཅོམ་ལྡན་མི་ཕམ་བརྟུལ་ཞུགས་རྒྱལ་མཚན་དང་། །ཤིང་གི་རི་བོ་རྒྱལ་བ་དེ་དག་བཅུ། །རྒྱལ་བ་སཱ་ལའི་རྒྱལ་པོ་དཔལ་གྱི་མཆོག །
en: Then there were the Jina Vara­lakṣaṇa­śrī, Vratamaṇḍala, and Svaśarīra­prabha, {42} “Then Nārāyaṇa­vrata­sumeru­śrī, The Jina Guṇa­cakravāla­śri­rāja, The Bhagavat Aparājita­vrata­dhvaja, And Druma­parvata, the tenth of those jinas.

source: འཇིག་རྟེན་དབང་པོའི་ལུས་ནི་སྣང་བའི་འོད། །མངོན་པར་འཕགས་འོད་དཔལ་གྱི་བཅོམ་ལྡན་འདས། །རྡོ་རྗེ་འོད་དང་ས་ཡི་གཟི་བརྗིད་དཔལ། །རྒྱལ་བ་ཟབ་ཆོས་འོད་ཀྱི་རྒྱལ་པོ་དཔལ། །ཆོས་ཀྱི་རྒྱ་མཚོ་དབྱངས་ཀྱི་བློ་གྲོས་དང་། །
en: {43} “Then there were the Jina Sālendra­rāja­śri­garbha, Lokendra­kāya­pratibhāsa­prabha, The Bhagavat Abhyudgata­prabha­śrī, Vajraprabha, and Dharaṇi­teja­śrī, {44} “Then the Jina Gambhīra­dharma­guṇa­rāja­śrī, Dharma­sāgara­nirghoṣa­mati, Merudhvajaśri, Prabhāsamati, And the tenth jina, Ratnarājaśri.

source: རི་རབ་རྒྱལ་མཚན་དཔལ་དང་བློ་གྲོས་སྣང་། །རྒྱལ་བ་བཅུ་པ་རིན་ཆེན་རྒྱལ་པོ་དཔལ། །ཚངས་པའི་འོད་དང་རྒྱལ་བ་ནམ་མཁའ་དབྱིངས། །དེ་བཞིན་ཆོས་ཀྱི་དབྱིངས་ནི་གཟུགས་བརྙན་དཔལ། །སྣང་བའི་དཀྱིལ་འཁོར་འོད་ཀྱི་བཅོམ་ལྡན་འདས། །ཐ་དད་ཕྱོགས་མཁྱེན་ཡེ་ཤེས་བློ་གྲོས་དང་། །ནམ་མཁའི་སྒྲོན་མ་མངོན་པར་དགའ་བའི་དཔལ། །རྣམ་པར་སྣང་མཛད་འོད་དཔལ་བདེ་བར་གཤེགས། །བསོད་ནམས་རབ་ཏུ་སྣང་དཔལ་ཞི་བའི་དཔལ། །བཅུ་པར་སྙིང་རྗེ་ཆེན་པོའི་སྤྲིན་གྱི་དཔལ། །
en: {45} “Then there were Brahmaprabha, the Jina Gagana­ghoṣa, Dharma­dhātu­pratibhāsa­śri, The Bhagavat Āloka­maṇḍala­prabha, And Diśabheda­jñāna­prabha­ketu­mati, {46} “Then Gagana­pradīpa, Abhirāmaśrī, The Sugata Vairocana­prabha­śrī, and Puṇya­prabhāsa­śri­śānta­śrī, And the tenth was Mahā­karuṇa­megha­śrī.

source: དེ་བཞིན་ཉིད་འོད་སྟོབས་སྣང་བློ་གྲོས་དང་། །རྒྱལ་བ་འགྲོ་བ་ཐམས་ཅད་མངོན་གཟུགས་དང་། །དེ་ཚེ་རྒྱལ་བ་མངོན་འཕགས་འོད་མང་འབྱུང་། །དེ་ཡི་འོག་མ་ཞི་བའི་སྐུ་ཡི་འོད། །
en: {47} “Then there were Tathatāprabha, Bala­prabhāsa­mati, And the Jina Sarva­jagadabhi­mukha­rūpa; Then there was Abhyudgata, And after him was Samaśarīra.

source: ཆོས་འཕགས་བདེ་གཤེགས་དེ་བཞིན་བྱུང་བར་འགྱུར། །དེ་ཡི་འོག་མ་རླུང་གི་དྲག་ཤུལ་དཔལ། །དཔའ་བའི་རྒྱལ་མཚན་རིན་ཆེན་ལུས་ཀྱི་དཔལ། །དུས་གསུམ་སྣང་བའི་འོད་ནི་བཅུ་པའོ། །སྨོན་ལམ་རྒྱ་མཚོ་རབ་ཏུ་སྣང་དཔལ་དང་། །
en: {48} “In the same way, there was the Sugata Dharmodgata, And after him came Anilavegaśrī, Śūradhvaja, and Ratna­gātra­śrī, And the tenth was Tryadhva­pratibhāsa­prabha.

source: གཉིས་པ་དགོངས་པ་རྡོ་རྗེ་རི་བོ་དཔལ། །རྒྱལ་བ་གསུམ་པ་སེང་གེ་རི་རབ་དཔལ། །དྲན་པའི་རྒྱལ་མཚན་རྒྱལ་པོ་ཆོས་དཔལ་བློ། །ཤེས་རབ་སྒྲོན་མ་འོད་ཀྱི་རྒྱལ་མཚན་དཔལ། །དེ་ཡི་འོག་མ་རྒྱལ་བ་རྒྱ་ཆེན་བློ། །
en: {49} “Then there was Praṇidhāna­sāgara­prabhāsa­śrī, The second was Vajrāśaya­giri­śrī, The third jina was Harisumeruśrī, And then there were Smṛti­ketu­rāja­śri and Dharmamati, {50} “Then Prajñāpradīpa, Prabha­ketu­śrī, And after them the Jina Vipulabuddhi, The Jina Dharma­dhātu­naya­jñāna­gati, And Dharma­samudra­mati­jñāna­śri.

source: རྒྱལ་བ་ཆོས་དབྱིངས་ཚུལ་གྱི་ཡེ་ཤེས་སྟབས། །ཆོས་ཀྱི་རྒྱ་མཚོ་བློ་གྲོས་ཡེ་ཤེས་དཔལ། །ཆོས་འཛིན་པ་དང་རིན་ཆེན་སྦྱིན་དཔལ་དང་། །རྒྱལ་བ་ཡོན་ཏན་ཁོར་ཡུག་དཔལ་གྱི་སྤྲིན། །བཟོད་པའི་སྒྲོན་མ་དཔལ་དང་གཟི་བརྗིད་ལྡན། །
en: {51} “Then there were Dharmadhara, Ratnadānaśri, The Jina Guṇa­cakravāla­śri­megha, Kṣānti­pradīpa­śrī, and Tejovat, And the Jina Vega­prabha­śamatha­ghoṣa, {52} “Then Śānti­dhvaja­jagatpradīpa­śrī, The Buddha Mahā­praṇidhi­vega­śrī, The Bhagavat Aparājita­dhvaja­bala, And the Jina Jñānārci­sāgara­śrī.

source: ཤུགས་འོད་ཞི་གནས་དབྱངས་ཀྱི་རྒྱལ་བ་དང་། །ཞི་བའི་རྒྱལ་མཚན་འགྲོ་བའི་སྒྲོན་མ་དཔལ། །སངས་རྒྱས་སྨོན་ལམ་ཆེན་པོ་ཤུགས་ཀྱི་དཔལ། །བཅོམ་ལྡན་གཞན་གྱིས་མི་ཐུབ་རྒྱལ་མཚན་སྟོབས། །རྒྱལ་བ་ཡེ་ཤེས་འོད་འཕྲོ་རྒྱ་མཚོ་དཔལ། །རྒྱལ་བ་ཆོས་དབང་བློ་གྲོས་ཆགས་པ་མེད། །འགྲོ་སྐད་རྒྱ་མཚོ་དབྱངས་ཀྱི་བློ་གྲོས་དང་། །ཐམས་ཅད་དབྱངས་ཀྱི་ཡན་ལག་སྒྲ་སྐད་དཔལ། །དབང་སྒྱུར་མཆོད་སྦྱིན་གྲགས་པའི་མཆོད་སྡོང་བློ། །ཕྱོགས་ཡུལ་འགྲོ་བ་མངོན་སུམ་བཅོམ་ལྡན་འདས། །སེམས་ཅན་བསམ་པར་མཉམ་པ་སྐུ་ཡི་དཔལ། །
en: {53} “Then there were the Jina Dharmeśvara, Asaṅga­mati, Jaga­mantra­sāgara, Nirghoṣamati, Sarva­svarāṅga­ruta­ghoṣa­śrī, Vaśa­vartiyajñayaśayaṣṭi­mati, {54} “The Bhagavat Diśadeśā­mukha­jaga, Sattvāśaya­sama­śarīri­śri, The Buddha Parārtha­savihāra­śrī, And the Jina Prakṛtīśarīra­śrī­bhadra.

source: གཞན་ཡང་སངས་རྒྱས་གནས་དང་བཅས་པའི་དཔལ། །རྒྱལ་བ་རང་བཞིན་ལུས་དཔལ་བཟང་པོ་དང་། །དེར་ནི་རྒྱལ་བ་དེ་ལ་སྩོགས་པ་བྱུང་། །
en: {55} “Those jinas and the others appeared there.

source: དེ་དག་བྱུང་ནས་འགྲོ་བ་སྒྲོན་མ་མཛད། །
en: When they appeared, they were lamps for the world.

source: བསྐལ་པ་རི་རབ་ཤིན་ཏུ་ཕྲ་རྡུལ་སྙེད། །བདག་གིས་རྒྱལ་བ་རྒྱ་མཚོ་དེ་དག་མཆོད། །
en: I made offerings to that ocean of jinas For as many kalpas as there are atoms in Sumeru.

source: བསྐལ་པ་སངས་རྒྱས་ཞིང་གི་རྡུལ་སྙེད་པོ། །དེ་དག་དུ་ནི་རྒྱལ་བ་གང་བྱུང་བ། །བདེ་གཤེགས་དེ་དག་ཐམས་ཅད་བདག་གིས་མཆོད། །རྣམ་པར་ཐར་པའི་ཚུལ་ནི་འདི་ལ་ཞུགས། །
en: {56} “Whatever jinas have appeared in kalpas As numerous as the atoms in a buddha realm, I have made offerings to all those sugatas And followed this way of liberation.

source: རྣམ་པར་ཐར་པའི་ཚུལ་འདི་སྒོམ་བྱེད་ཅིང་། །བསྐལ་པ་མཐའ་ཡས་བདག་གི་སྔོན་སྤྱད་ཀྱིས། །
en: {57} “I have practiced throughout endless past kalpas, Meditating on this way of liberation.

source: ཁྱོད་ཀྱིས་ཐོས་ནས་ནན་ཏན་མྱུར་གྱིས་ཤིག །ཚུལ་འདི་རིང་པོ་མི་ཐོགས་ཐོབ་པར་འགྱུར། །
en: Having heard it, practice it quickly, And you will attain this way before long.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འཇིག་རྟེན་ཐམས་ཅད་མངོན་དུ་གྱུར་པས། འགྲོ་བ་རྣམ་པར་འདུལ་བ་སྟོན་པ་འདི་ཤེས་པར་ཟད་ན།
en: {58} “Noble one, I know only this bodhisattva liberation called the manifestations that guide beings that appear in all worlds.

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་དང་དབུས་མེད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་ལ་མོས་པ་སྣ་ཚོགས་ཀྱིས་ཡང་དག་པར་གནས་པ། བསམ་པ་སྣ་ཚོགས་ཀྱིས་ལུས་དང་ལྡན་པ། །དབང་པོ་རྒྱ་མཚོ་སྣ་ཚོགས་ཡོངས་སུ་གྲུབ་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། སྨོན་ལམ་སྣ་ཚོགས་ཤིན་ཏུ་རྟོགས་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: How could I know the conduct or describe the qualities of bodhisattvas who remain in the aspiration to an ocean of bodhisattva conduct that has no outer limit or center, who have bodies in accordance with the various dispositions of beings, who accomplish an ocean of various faculties, and who have the realization of the various kinds of bodhisattva conduct and prayers?

source: སོང་རིགས་ཀྱི་བུ་སྙིང་པོ་བྱང་ཆུབ་འདི་ཉིད་ན་ཁོ་མོ་དང་རྒྱང་མི་རིང་བ་ཞིག་ན་མཚན་མོའི་ལྷ་མོ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་པདྨོའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣང་བའི་རྒྱལ་མཚན་གྱིས་རབ་ཏུ་བརྒྱན་པ་ཞིག་ལ་འདུག་ཅིང་།
en: Here in the bodhimaṇḍa, there is the goddess of the night named Praśanta­ruta­sāgara­vatī. “She is seated on a lotus throne with the adornment of shining banners of kings of jewels in its center, and with an entourage of countless millions of night goddesses.

source: མཚན་མོའི་ལྷ་མོ་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་འཁོར་གྱིས་བསྐོར་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct?

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་བརྒྱད་པ།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the night goddess Samanta­sattva­trāṇojaḥ­śrī, circumambulated the night goddess Samanta­sattva­trāṇojaḥ­śrī many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the night goddess Samanta­sattva­trāṇojaḥ­śrī.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འཇིག་རྟེན་ཐམས་ཅད་མངོན་དུ་གྱུར་པས་འགྲོ་བ་རྣམ་པར་འདུལ་བ་དེ་ལ་ཡོངས་སུ་སྒོམ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། ཡིད་ཆེས་པར་བྱ་བ་དང་། འཇུག་པར་བྱ་བ་དང་། ཤིན་ཏུ་རྒྱས་པར་བྱ་བ་དང་། ཡོངས་སུ་ཁྱབ་པར་བྱ་བ་དང་། རབ་ཏུ་མཆོད་པར་བྱ་བ་དང་། དབང་དུ་བྱ་བ་དང་། སྣང་བར་བྱ་བ་དང་། ཡང་དག་པར་གཞོལ་བར་བྱ་བ་བྱེད་ཅིང་།
en: Praśanta­ruta­sāgara­vatī Chapter 38 Sudhana, the head merchant’s son, meditating on the night goddess Samanta­sattva­trāṇojaḥ­śrī’s bodhisattva liberation called the manifestations that guide beings that appear in all worlds, and contemplating it, having faith in it, engaging in it, increasing it, expanding it, augmenting it, gaining power over it, illuminating it, and being absorbed in it, approached the night goddess Praśanta­ruta­sāgara­vatī.

source: མཚན་མོའི་ལྷ་མོ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་། ལྡན་པ་གང་ན་བ་དེར་ཕྱིན་ཏེ། མཚན་མོའི་ལྷ་མོ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མཚན་མོའི་ལྷ་མོ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། མཚན་མོའི་ལྷ་མོ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པའི་མདུན་དུ་འདུག་སྟེ།
en: He bowed his head to the night goddess Praśanta­ruta­sāgara­vatī’s feet, circumambulated the night goddess Praśanta­ruta­sāgara­vatī many hundreds of thousands of times, and then stood before the night goddess Praśanta­ruta­sāgara­vatī.
